# --- 设备配置 ---
# 手机设备 ID
DEVICE_ID = "IBWO4PAIFMQKGISC"

# --- 分辨率和坐标 ---
# 脚本基于的分辨率
BASE_RESOLUTION_W = 2560
BASE_RESOLUTION_H = 1440

# placeCard.py 中的坐标
CARDS_X = [455, 720, 975, 1250]
CARDS_Y = [2273, 2450, 2273, 2273]
PLACES_X = [680, 754, 154, 1304, 680, 754, 680, 754, 346, 1085, 520, 900]
PLACES_Y = [1926, 1926, 1890, 1890, 1487, 1487, 1158, 1158, 1164, 1164, 725, 725]

# finalGetCards.py 中的区域
# 基于竖屏分辨率 1440x2560 的坐标
CARD_REGIONS = [
    (280, 2100, 300, 330),   # 第一张卡牌
    (580, 2100, 300, 330),   # 第二张卡牌
    (850, 2100, 300, 330),   # 第三张卡牌
    (1120, 2100, 300, 330)   # 第四张卡牌
]
NEXT_CARD_REGION = (80, 2390, 120, 150) # 下一张卡牌

# checkType.py 中的区域
START_REGION_COORDS = (2460, 2530, 280, 1400) # (y1, y2, x1, x2)
END_REGION_COORDS = (2200, 2300, 625, 800) # (y1, y2, x1, x2)